In [1]:
import pandas as pd

In [2]:
x = pd.read_excel("Student_data.xlsx")

In [3]:
x

     Name  Class Seaction    City   Mobile No          Email Id
0     Raj      5        A    Agra  4525943587     Raj@gmail.com
1  Aakash      8        C   Delhi  5789256418  Aakash@gmcil.com
2     Ram      4        A    Pune  3154687219     Ram@gmail.com
3   Shyam     11        B  Indore  6493587524   Shyam@gmbil.com
4   Nitin     12        C  Mumbai  6416231125   Nitin@gmcil.com

# If you want to see particular Column

### There are tow dirrerent ways to see particular Column

In [4]:
# 1
x["Name"]

0       Raj
1    Aakash
2       Ram
3     Shyam
4     Nitin
Name: Name, dtype: object

In [5]:
# 2
x[["Name"]]

     Name
0     Raj
1  Aakash
2     Ram
3   Shyam
4   Nitin

### See particular item in Column

In [6]:
x["Name"][0]

'Raj'

# If you want to see particular Row

### There are tow dirrerent ways to see particular Row

In [7]:
x.iloc[0]

Name                   Raj
Class                    5
Seaction                 A
City                  Agra
Mobile No       4525943587
Email Id     Raj@gmail.com
Name: 0, dtype: object

In [8]:
x.iloc[[0]]

  Name  Class Seaction  City   Mobile No       Email Id
0  Raj      5        A  Agra  4525943587  Raj@gmail.com

### See particular item in Row

In [9]:
x.iloc[0][3]

'Agra'